export class Belbin {
  static about =
    'Энэхүү багт гүйцэтгэх үүргийг тодорхойлох тестийн тайлан нь таны үнэлгээний үр дүнд суурилсан болно. Энэ тайлангаас та дараах зүйлсийг мэдэх боломжтой.\nҮүнд:\n\tТаны багт гүйцэтгэх голлох дүр\n\tБагт оруулж буй хувь нэмэр, таны гүйцэтгэж буй багийн дүр';
  static advice =
    'Дан ганц зан төлөвийг тодорхойлох бус багт гүйцэтгэх үүргийг нь давхар бодолцож багийг бүрдүүлэх нь багийн хамтын ажиллагааг сайжруулахад чухал ач холбогдолтой. Белбиний багийн дүрийг тодорхойлох тестийн хувьд хувь хүний ажлын байран дээрх зан төлөв, хариу үйлдлүүдэд суурилан тухайн хүнд тохирох хамгийн тохиромжтой багийн дүрийг тодорхойлдгоороо Психометрик тестүүдээс ялгаатай юм.\n\nЭнэхүү тестийн үр дүнд сайн, муу, зөв, буруу хариулт гэж байхгүй болохыг анхаарна уу. Энэхүү тайлантай танилцсаны дараа багийн гишүүдээ ойлгох, хамтарч ажиллах чадвараа хөгжүүлэх гарын авлагатай ажиллаарай.';
  static values = [
    'Plant',
    'Monitor/Evaluator',
    'Specialist',
    'Shaper',
    'Implementer',
    'Completer/Finisher',
    'Coordinator',
    'Team Worker',
    'Resource Investigator',
  ];

  public result(v: string) {
    let res = {
      name: '',
      key: '',
      description: '',
      hobby: '',
      contribution: '',
      describe: '',
      character: '',
    };

    const value = v.toLowerCase();
    if (value == 'plant') {
      res = {
        name: 'СЭТГЭГЧ',
        key: 'pl',
        character: 'Интроверт, сэтгэгч, мөрөөдөмтгий,философич',
        description:
          'Багийн бүтээлчээр сэтгэгч байдаг. Шинийг санаачилдаг, ажлын хамгийн эхний хар зураг, хувилбарыг ихэвчлэн санал болгодог. Чөлөөтэй, фантази сэтгэдэг, шинэ нөхцөлд ч асуудлыг цогцоор нь дүрслэн бодож бүтээлч хувилбар санал болгодог. Хэт практикал биш, заримдаа бусад хүмүүс өөрөөс нь юу шаардаж байгааг анзаарахгүйгээр ажиллах хандлагатай.',
        hobby:
          'Оюун ухаан сорьсон ажил, бүтээлч, тайван, нам гүм байдал, хүлээн зөвшөөрөгдөх байдал зэрэгт дуртай.',
        contribution:
          'Бүтээлч байдал, шинэлэг санааг авчирдаг. Хүнд асуудлуудын шийдлийг олдог.',
        describe:
          'Хэт бодитой биш, туршиж үзэлгүйгээр ба практик үр дүнг сайн бодолгүйгээр хийсвэр санааг сэтгэн гаргаж ирдэг.',
      };
    }
    if (value == 'monitor/evaluator')
      res = {
        name: 'ШИНЖЭЭЧ',
        key: 'me',
        character:
          'Ухаалгаар үнэлгээ өгдөг, асуудлыг задлан шинжилдэг, асуулт асууж логик учир шалтгааныг тодорхойлж гаргадаг.',
        description:
          'Эмзэг, мэдрэмтгий, болгоомжтой, шүүмжлэлтэй ханддаг. Багийн шинжээч нь байдаг. Тэрээр үргэлжнөхцөл байдлыг задлан шинжилдэг. Аливааг удаан, нягт нямбай хийдэг. Шийдэл нь барагтаа л бол буруу байдаггүй',
        contribution:
          'Аливааг тоймлон, үнэн зөв дүн шинжилгээ, дүгнэлтүүдийг гаргаж өгдөг. Стратегийн болон шүүмжлэлт чухал санааг багт оруулдаг.',
        describe:
          'Удаан байж магадгүй, хэтэрхий шүүмжлэлтэй хандаж магадгүй. Заримдаа тодорхойгүй, хүйтэн хөндий мэт харилцаатай.',
        hobby: 'Тоймлон дүн шинжилгээ хийх, нэгтгэн дүгнэж ойлгох дуртай.',
      };
    if (value == 'specialist')
      res = {
        name: 'МЭРГЭЖИЛТЭН',
        key: 'sp',
        character:
          'Мэргэшсэн, чимээгүй, үүрэг даалгаварт хүчтэй төвлөрдөг, зөвлөгч байдаг.',
        contribution:
          'Нарийн мэргэшсэн чиглэлээрээ багтаа зөвлөх үүрэгтэй байдаг.',
        describe:
          'Нээлттэй хамтран ажиллах ур чадвар дутдагаас болж зарим хүмүүс таны зөвлөгөөг авахгүй байх магадлалтай.',
        hobby:
          'Бие даан ажиллах дуртай, тайван саад болохооргүй нөхцөлд ажиллахыг дэмждэг, мэдлэгээ гайхуулах боломж гарвал таатай ханддаг.',
        description:
          'Мэргэшсэн чиглэлдээ жинхэнэ мэдлэгийн уурхай байдаг. Зөвлөгөө өгөх дуртай. Өөрийнхөө мэргэшсэн чиглэлээрээ мэдлэгээ бусдад хуваалцаж, зарим тохиолдолд бардамнах дуртай. Техникийн ур чадвараараа багтаа ноёрхдог. Хамт олны нийтийг хамарсан албан бус үйл ажиллагааг хэр бараг тоодоггүй.',
      };
    if (value == 'shaper')
      res = {
        name: 'sh',
        key: 'SHAPER',
        character:
          'Хүсэл тэмүүлэлтэй, эрмэлзэлтэй, өрсөлдөөч, зоригтой, тэвчээргүй.',
        contribution:
          'Багийн ажлыг урагшлуулахад өндөр хувь нэмэр оруулдаг, үр дүнтэй бүтээмжтэй ажилладаг, асуудлын ард ямагт гардаг, зөрчилдөөнийг амархан шийддэг.',
        describe:
          'Хүмүүсийг заримдаа уурлуулах гомдоодог. Амбицгүй хүмүүст дургүй ханддаг.',
        hobby:
          'Өрсөлдөөч байдал, үр дүнд тулгуурласан хандлагад дуртай ба ямагт хожихыг хүсдэг.',
        description:
          'Хүсэл тэмүүлэлтэй, эрмэлзэлтэй, хурдан гүйцэтгэл хийх гэж яардаг. Хүч сорьсон сорилтууд хайдаг. Яг хугацаандаа багтааж дуусгах, зорилгодоо хүрэхийг эрмэлздэг. Заримдаа уцаарлах эсвэл сэтгэл хөдлөлөөрөө асуудалд хандах байдал гаргадаг.',
      };
    if (value == 'implementer')
      res = {
        name: 'imp',
        key: 'IMPLEMENTER',
        character:
          'Аливаад зохион байгуулалттай ханддаг, шаргуу хөдөлмөрч, амьдралд ойрхон бодитой, мэргэжлийн талаас ханддаг, ямар ажил юу болохгүй байна гэдгийг маш сайн олж хардаг.',
        contribution:
          'Багийн практик хэрэгжилтийг зохион байгуулалтаар хангадаг, төлөвлөгөө, үйл явцыг хянаж, түүнд санаа тавьдаг. Төлөвлөгөөний хэрэгжилтийг маш сайн хангаж гүйцэтгэдэг, системтэй, цэгцтэй ажиллагаагаар багт хувь нэмэр оруулдаг.',
        describe:
          'Бодож тооцоолохоосоо өмнө үйлдэл хийдэггүй, уян хатан бус байдаг, хэт хурдан шинэчлэлтийг хүлээн авдаггүй.',
        hobby:
          'Тодорхой нарийн заавар, тогтмол, хэмнэлтэй ажиллах, хоёрдмол санаагүй тодорхой тохиролцоотой байх.',
        description:
          'Хэрэгжүүлэгч нь баг доторх практик зохион байгуулагч байдаг. Сахилга баттай, зарчимч, эмх цэгцтэй ба даалгаварт төвлөрсөн байдаг. Үр дүн хурдан гардаг ажлуудад санаа нь илүү төвлөрч, түүнийг төлөвлөж ажилладаг. Шинэ санаачилга хэрэг болох үед хэтэрхий практик тал руу хандаж, хуучинсаг байдлаар ханддаг.',
      };
    if (value == 'completer/finisher')
      res = {
        name: 'ДУУСГАГЧ',
        key: 'cf',
        description:
          'Дуусгагч нь аливааг буруудаж магадгүй гэдгийг дандаа мэдэрдэг төрөлхийн авьяастай. Тийм ч утгаараа илүү деталь зүйлд анхаарлаа тавьдаг. Дахин дахин нягталж шалгадаг. Төгс байдлыг эрэлхийлдэг. Чанар болон аюулгүй байдалд анхаарлаа хандуулдаг. Заримдаа хэтэрхий хянамгай байдаг тул ажлаа бусдад итгэж шилжүүлдэггүй, ихэвчлэн өөрөө хийх гэж оролддог.',
        contribution:
          'Хэт их санаа зовомтгой, иймээс заримдаа зориг муутай, ажлаа шилжүүлэх дургүй, жижиг сажиг зүйлээр хөөцөлдөх хандлагатай байдаг.',
        hobby:
          'Аюулгүй, эрсдэлгүй байдал, чанартай байх, деталь хандах зэрэгт тааламжтай ханддаг.',
        describe:
          'Хэт их санаа зовомтгой, иймээс заримдаа зориг муутай, ажлаа шилжүүлэх дургүй, жижиг сажиг зүйлээр хөөцөлдөх хандлагатай байдаг.',
        character:
          'Ухамсартай, шударга, төгс байдлыг эрэлхийлэгч, детальд төвлөрдөг, хэтэрхий санаа зовомтгой, нягт нямбай.',
      };
    if (value == 'coordinator')
      res = {
        name: 'ЗОХИЦУУЛАГЧ',
        key: 'co',
        description:
          'Багийн жинхэнэ зохицуулагч нь байдаг. Аливаа үйл ажиллагааны процедурыг нарийвчлан хянадаг. Багийн гишүүн бүрийн хүсэл зоригийг нэгтгэдэг. Хүмүүсийн ур чадвар, боломж, авьяасыг бүрэн дүүрэн ашигладаг, багийн гишүүддээ итгэл хүлээлгэж ажил шилжүүлдэг. Гэхдээ заримдаа бусдад хэт их ачаалал өгөх хандлагатай байдаг..',
        describe:
          'Зорилгодоо хүрэхийн тулд ямар ч хамаагүй арга хэрэглэдэг. Ажлуудаа бусдад итгэж шууд шилжүүлдэг.',
        hobby:
          'Процедур, шат дараалал, шийдвэр, хүчин чармайлт, зорилго тодорхойлсон байдал, хамтын ажиллагаа.',
        contribution:
          'Зорилгоо тодорхой болгодог, ажлыг бүтэцлэж, зохион байгуулалтанд оруулдаг. Бэрхшээлтэй, хүнд шийдвэрүүдтэй өөрөө тулж хариуцан шийдвэр гаргаж чаддаг.',
        character:
          'Жинхэнэ зохицуулагч, тайван, тэвчээртэй, эерэг, нээлттэй, сониуч',
      };

    if (value == 'team worker')
      res = {
        name: 'БАГИЙН ТОГЛОГЧ',
        key: 'tw',
        character:
          'Нийтэч, харилцаа сайтай, хүмүүст төвлөрдөг, зөөлөн, дипломатч, нийцтэй, үгэнд ордог, хөгжилтэй, мэдрэмжтэй.',
        contribution:
          'Харилцаа төвтэй, мэдрэмжтэй, халамжтай, хамтын ажиллагааг багт бий болгож чаддаг. Багт сэтгэлзүйн дулаан, таатай уур амьсгалыг бий болгодог.',
        describe:
          'Шийдэмгий биш, зөрчилдөөнөөс зайлсхийдэг, зөрчилдөөнтэй асуудалтай нүүр тулахаас зайлсхийдэг.',
        hobby:
          'Хамтач, уялдаа холбоотой, хүнтэй сайн харилцаа холбоотой байхад тааламжтай ханддаг.',
        description:
          'Багийн хамгийн мэдрэмтгий нь. Бусдадаа тусч, таатай уур амьсгалыг бүрдүүлэгч, хамтран ажиллахын ач тусыг чухалчилдаг. Хүмүүсийг эвтэй байх нөхцөлийг бүрдүүлэхийг хичээдэг. Хэцүү цаг үед шийдвэр гаргахдаа тааруу.',
      };
    if (value == 'resource investigator')
      res = {
        name: 'САНААЧЛАГЧ',
        key: 'ri',
        character:
          'Экстроверт, харилцаа сайтай, хөгжилтэй, алиа, урам зориг тэмүүлэлтэй, байгалиас заяасан санаачлагч, сониуч',
        contribution:
          'Олон тооны танилын хүрээ нь багт хэрэгтэй байдаг. Түүнчлэн шинэ санаа боломжуудыг багт авчирдаг. Маш сайн санаачлагч байдаг.',
        describe:
          'Хэт амархан хувирах, өөрчлөгдөх, хэт их урам зориг, хэт өөдрөг байдал, өмнөхөө дуусгаагүй байж өөр ажил эхлүүлдэг.',
        hobby:
          'Шинэчлэлд дуртай, хүмүүстэй тогтоосон харилцаа холбоо сайн байхыг дэмждэг, олон талт, адал явдалтай байдалд тааламжтай ханддаг.',
        description:
          'Гадагшаа чиглэсэн, баяр баясгалантай, олон хүмүүстэй харилцаатай, сайн найз нөхөр байдаг. Түүнчлэн багаас гадуур танилын хүрээ ихтэй. Хүмүүсийг дэмждэг, адал явдалд дуртай, нээлттэй сэтгэлгээтэй, шинэ санаа гаргахыг эрмэлздэг. Байгалиас заяасан сайн тал нь аливаа харилцааг тогтоох түүнийг авч үлдэх хадгалах шинжтэй.',
      };
    return res;
  }
}
