export class Belbin {
  public result(v: string) {
    let res;
    const value = v.toLowerCase();
    if (value == 'plant') {
      res = {
        name: 'СЭТГЭГЧ',
        key: 'Plant',
        character: 'Интроверт, сэтгэгч, мөрөөдөмтгий,философич',
        description:
          'Багийн бүтээлчээр сэтгэгч байдаг. Шинийг санаачилдаг, ажлын хамгийн эхний хар зураг, хувилбарыг ихэвчлэн санал болгодог. Чөлөөтэй, фантази сэтгэдэг, шинэ нөхцөлд ч асуудлыг цогцоор нь дүрслэн бодож бүтээлч хувилбар санал болгодог. Хэт практикал биш, заримдаа бусад хүмүүс өөрөөс нь юу шаардаж байгааг анзаарахгүйгээр ажиллах хандлагатай.',
        hobby:
          'Оюун ухаан сорьсон ажил, бүтээлч, тайван, нам гүм байдал, хүлээн зөвшөөрөгдөх байдал зэрэгт дуртай.',
        contribution:
          'Бүтээлч байдал, шинэлэг санааг авчирдаг. Хүнд асуудлуудын шийдлийг олдог.',
        describe:
          'Хэт бодитой биш, туршиж үзэлгүйгээр ба практик үр дүнг сайн бодолгүйгээр хийсвэр санааг сэтгэн гаргаж ирдэг.',
      };
    }
    if (value == 'monitor/evaluator')
      res = {
        name: 'ШИНЖЭЭЧ',
        key: 'MONITOR/ EVALUATOR',
        character:
          'Ухаалгаар үнэлгээ өгдөг, асуудлыг задлан шинжилдэг, асуулт асууж логик учир шалтгааныг тодорхойлж гаргадаг.',
      };
    if (value == 'specialist')
      res = {
        name: 'МЭРГЭЖИЛТЭН',
        key: 'SPECIALIST',
        character:
          'Мэргэшсэн, чимээгүй, үүрэг даалгаварт хүчтэй төвлөрдөг, зөвлөгч байдаг.',
      };
    if (value == 'shaper')
      res = {
        name: 'ХЭЛБЭРЖҮҮЛЭГЧ',
        key: 'SHAPER',
        character:
          'Хүсэл тэмүүлэлтэй, эрмэлзэлтэй, өрсөлдөөч, зоригтой, тэвчээргүй.',
      };
    if (value == 'implementer')
      res = {
        name: 'ХЭРЭГЖҮҮЛЭГЧ',
        key: 'IMPLEMENTER',
        character:
          'Аливаад зохион байгуулалттай ханддаг, шаргуу хөдөлмөрч, амьдралд ойрхон бодитой, мэргэжлийн талаас ханддаг, ямар ажил юу болохгүй байна гэдгийг маш сайн олж хардаг.',
      };
    if (value == 'coordinator')
      res = {
        name: 'ЗОХИЦУУЛАГЧ',
        key: 'COORDINATOR',
        character:
          'Жинхэнэ зохицуулагч, тайван, тэвчээртэй, эерэг, нээлттэй, сониуч',
      };
    if (value == 'team worker')
      res = {
        name: 'БАГИЙН ТОГЛОГЧ',
        key: 'TEAM WORKER',
        character:
          'Нийтэч, харилцаа сайтай, хүмүүст төвлөрдөг, зөөлөн, дипломатч, нийцтэй, үгэнд ордог, хөгжилтэй, мэдрэмжтэй.',
      };
    if (value == 'resource investigator')
      res = {
        name: 'САНААЧЛАГЧ',
        key: 'RESOURCE INVESTIGATOR',
        character:
          'Экстроверт, харилцаа сайтай, хөгжилтэй, алиа, урам зориг тэмүүлэлтэй, байгалиас заяасан санаачлагч, сониуч',
      };
    return res;
  }
}
