import { ExamEntity } from 'src/app/exam/entities/exam.entity';
import { ResultEntity } from 'src/app/exam/entities/result.entity';
import {
  assetPath,
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/app/exam/reports/formatter';
import { SinglePdf } from 'src/app/exam/reports/single.pdf';

export class Empathy {
  constructor(private single: SinglePdf) {}
  async template(
    doc: PDFKit.PDFDocument,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    header(doc, firstname, lastname);
    title(doc, result.assessmentName);
    info(
      doc,
      exam.assessment.author,
      exam.assessment.description,
      exam.assessment.measure,
      exam.assessment.usage,
    );
    doc
      .font('fontBold')
      .fontSize(16)
      .fillColor(colors.orange)
      .text('Товч мэдээлэл', marginX, doc.y + 10);
    doc
      .moveTo(40, doc.y + 2)
      .strokeColor(colors.orange)
      .lineTo(100, doc.y + 2)
      .stroke()
      .moveDown();

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Эмпатик харилцааг ойлгохын тулд эхлээд эмпати гэж юу болох талаар ойлголттой болох хэрэгтэй юм.\n\n"Агшин зуурт бие биеийнхээ харцанд гүн нэвтрэхээс илүү гайхамшиг бий гэж үү?"\n- Хенри Девид Торо, яруу найрагч, эсээ бичээч\n\nЭмпатийн оноо нь хувь хүн болгонд ялгаатай илэрч болох ба зарим хүмүүс төрөлхийн эмпатийн түвшин өнөр, зарим нь эмпатийн түвшин сул байдгийг харуулна. Гэвч эмпати нь хөгжиж болох чадвар тул бага оноо авсан хүн ч гэсэн зөв аргачлалаар ажилласнаар өөрийн эмпатийн түвшинг дээшлүүлэх бүрэн боломжтой юм.',
        { align: 'justify' },
      );
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Үр дүн');

    let levelLabel = '';

    if (Number(result.point) <= 44) {
      levelLabel = 'Эмпатийн түвшин сул';
    } else if (Number(result.point) <= 54) {
      levelLabel = 'Эмпатийн оноо тогтвортой түвшинд';
    } else {
      levelLabel = 'Өндөр түвшний эмпатийн мэдрэмжтэй';
    }

    doc
      .fillColor(colors.orange)
      .font('fontBlack')
      .fontSize(28)
      .text(`${result.point ?? ''}`, doc.x, doc.y, { continued: true })
      .fontSize(12)
      .font(fontNormal)
      .fillColor(colors.black)
      .text('  оноо буюу  ', doc.x, doc.y + 11.35, {
        continued: true,
      })
      .font('fontBlack')
      .fontSize(16);
    doc
      .fillColor(colors.orange)
      .text(levelLabel.toUpperCase(), doc.x, doc.y - 2.5)
      .moveDown(-0.5);

    await this.single.examQuartileGraph(doc, result);
    // doc
    //   .font(fontBold)
    //   .fontSize(13)
    //   .text(levelLabel, marginX, doc.y)
    //   .moveDown(0.5);

    let messageText =
      'Таны авсан дундажаас ялимгүй доогуур байна. Энэ нь та бусдын сэтгэл хөдлөл, дотоод мэдрэмжийг анзаарах, мэдрэх, хуваалцах тал дээр зарим тохиолдолд төдийлөн хүчтэй хариу үзүүлдэггүй байж магадгүй гэсэн үг. Та бусдын баяр хөөр, гуниг зовлонг мэдэрч байгаа ч түүнийгээ шууд илэрхийлэх эсвэл тэр мэдрэмжийг өөрийнхөөрөө хуваалцах нь амаргүй байж болох юм. Үүний улмаас зарим нөхцөл байдалд бусдын сэтгэлийн байдлыг анзаарахгүй өнгөрөх, эсвэл яаж зөв хариу үзүүлэхээ мэдэхгүй үлдэх нь элбэг байдаг.\n\nЖишээлбэл, найз тань сэтгэлээр унасан үед та түүнд санаа зовж болох ч яг ямар үг хэлэх, хэрхэн тайвшруулах нь дээр вэ гэдгээ мэдэхгүй байх магадлалтай. Эсвэл тухайн мэдрэмжийг нь бүрэн ойлгож амжаагүй байхад өөр сэдэв рүү хазайх хандлага ажиглагдаж болох юм.\n\nТаны авсан оноо “дандаа ийм л байна” гэсэн шүүлт биш – харин хаанаас хөгжлөө эхлүүлж болохыг зааж буй гарц юм. Эмпати бол төрмөл шинжээс гадна сургуулилт, ажиглалт, ухамсартай хандлагаар хөгжиж болох чадвар юм.';

    if (result.point >= 45 && result.point <= 54) {
      messageText =
        'Таны эмпатийн оноо дундаж тогтвортой төвшинд байна. Энэ нь та бусдын сэтгэл хөдлөлийг ойлгож, мэдэрч чаддаг ч зарим нөхцөлд тийм ч хүчтэй, хурц хариу мэдрэмж илэрдэггүй байж болохыг илтгэж байна.\n\nТа ойр дотныхоо хүнийг гунигтай, баяртай байгааг анзаарч, зохих хариу үйлдэл үзүүлэхдээ тэнцвэртэй ханддаг хүн юм. Бусдын мэдрэмжийг шууд тусгаж авахын оронд нөхцөл байдлыг ажиглаж, ойлгож, бодож байж хариу илэрхийлэх нь таны хувьд түгээмэл арга мэт харагдаж байна.\n\nТаны авсан оноо бол суурь оноо юм. Учир нь та аливаа мэдрэмж, үйл явдлыг нэг бол сэтгэл хөдлөлөөр шууд дагаж, нөгөө бол хэт хөндий хандах албан ёсны аль алинаас ангид — тэнцвэртэй байр суурьтай байна гэсэн үг.';
    } else if (result.point >= 55 && result.point <= 64) {
      messageText =
        'Таны авсан оноо таныг өндөр түвшний эмпатийн мэдрэмжтэй хүн болохыг харуулж байна. Та бусдын баяр баясгалан, уйтгар гунигийг өөрийн сэтгэл зүрхээрээ мэдэрч, тэр мэдрэмжид хариу үйлдэл үзүүлдэг гүн мэдрэмжтэй хүн юм.\n\nИйм түвшний эмпати нь бусдыг зөвхөн ойлгохоос гадна — тэдэнд хариу үйлдэл үзүүлж, дэм болж, сэтгэлээрээ хамт байх чадварыг илтгэнэ. Та өөрийн оронд бусдыг тавьж бодох, тэдний мэдрэмжийг хуваалцаж, халамж дүүрэн ханддаг өрөвч сэтгэлтэй, энэрэнгүй хүн байна. Ийм хүмүүс бусдад амархан итгэл төрүүлдэг, ярилцахад тайвшрал авчирдаг, бусдын дэргэд байхад тухтай мэдрэмж төрүүлдэг. Та амьдралдаа аль хэдийн олон хүний итгэл, хүндэтгэлийг хүлээж, өөрийн дотоод дулаан энергиэрээ бусдын сэтгэлийг тэтгэж ирсэн байх магадлалтай.\n\nГэхдээ таны эмпати бол зүгээр нэг мэдрэмж биш — энэ бол чадвар. Та үүнийг мэдрээд зогсохгүй, амьдрал дээр хэрэгжүүлж, бодит үйлдэл болгож чаддаг. Таны тусалсан, анхаарсан, хуваалцсан мөчүүд хэн нэгний хувьд үнэтэй дурсамж болон үлдсэн байх нь гарцаагүй.';
    }

    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(messageText, marginX, doc.y, { align: 'justify' });
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Эмпати гэж юу вэ?');
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Харилцааны хичээл заадаг сургалт бүрт "Эмпати” буюу бусдын оронд өөрийгөө тавьж, нөхцөл байдлыг тэдний харж буй өнцгөөс харж, ойлгож чадах нарийн мэдрэмж шаардсан ур чадварын талаар дурддаг.\n\nХүмүүс ихэвчлэн "Симпати” буюу бусдыг өрөвдөж хайрлах гэдэг үгийг сайн мэддэг. Учир нь голдуу хэн нэгнээ эсвэл ямар нэгэн зүйлээ алдсан хүмүүстэй учрах үед бидэнд ийм мэдрэмж төрдөг билээ. Харин эмпати, симпати хоёр нь хоорондоо нэлээд ялгаатай ойлголтууд юм. Оксфордын толь бичигт "Эмпати”-г "Бусдын бодол, мэдрэмжийг өөр дээрээ хүлээн авч, ойлгох чадвар” хэмээн тайлбарласан байна. Өөрөөр хэлбэл, бусдыг ойлгох, сэтгэлийн гүнд нь нэвтрэх буюу харилцагч талууд бие биетэйгээ хүчтэй холбогдож буй нөлөөллийг хэлдэг аж.\n\nЭмпати нь хэдийгээр оюун санааны хүчирхэг төлөв боловч бид түүнийг зүрх сэтгэлдээ хүчээр суулгачих зүйл биш агаад үүний үрийг өөртөө суулгаж, бусдад түтээх, өрөөл бусдыг ойлгож, энэрэх нигүүлсэнгүй сэтгэлийн тэнхээ билээ. Эмпати гэдэг нь хүн өөрийнхөө болоод бусдын сайн сайхны төлөө чин сэтгэлээсээ санаа тавьдаг, хүнлэг, хүмүүнлэг нэгэн болгох хамгийн чухал дотоод хөдөлгөгч хүч юм.',
        { align: 'justify' },
      )
      .moveDown(1);

    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text('Эмпати (Empathy)', doc.x, doc.y)
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Бусад хүний сэтгэлийн хөдөлгөөн, сэтгэл санааны байдлыг танин мэдэж ойлгох, түүний байр сууринд өөрийгөө тавьж үзэх, өрөвдөж хайрлах чадвар, бусдад тохиолдсон аливаа явдлыг өөрт тохиолдсон мэтээр хүлээн авах, мэдрэх, үүнийгээ илэрхийлэх чадвар юм.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(0.5);

    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text('Симпати (Sympathy)', doc.x, doc.y)
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Бусдад нааштай сайн сэтгэлээр, дотночлон хандах дотоод сэтгэлийн тогтвортой мэдрэмж.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Эмпати гэх хэллэг нь Англи хэлнээ анх 1909 онд орж ирсэн ба Edward Bradford Titchener анх Герман хэлний Einfühlung гэх үгнээс буулгажээ. Өнөө цагт “Эмпати” нь бусдыг ойлгож, бусдын сэтгэл хөдлөлийг (мэдрэмжийг) хуваалцах гэх байдлаар тодорхойлогдох болсон юм.\n\nҮүний дагуу эмпатик харилцаа нь нөгөө хүнийхээ мэдрэмжийг ойлгож, тэдний байгаа нөхцөл байдлыг ойлгохын тулд харилцаж буй харилцааны чадвар юм. Британи гаралтай Америк зохиолч, илтгэгч Саймон Синек (Simon Sinek) эмпати, бусдыг ойлгох чадвар нь хүчирхэг удирдагчдын гол чанар хэмээжээ. Энэхүү тодорхойлолтыг улам өргөжүүлж, эмпатик харилцаа гэж юу болохыг илүү сайн ойлгохын тулд хэд хэдэн мэргэжилтнүүдийн ойлголтыг дор тусгалаа.',
        { align: 'justify' },
      );
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Эмпатик харилцааны тухай');
    doc
      .font(fontBold)
      .fontSize(13)
      .fillColor(colors.black)
      .text(
        'Тодорхойлолт #1: Эмпатик харилцаа нь тухайн цаг мөчид байж, нөгөө хүнээ анхаарч сонсох явдал юм.',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Human Leader director, Burnout Researcher and Expert, Салли Кларкын хувьд эмпатик харилцаа нь тайлбарлахад амархан зүйл бөгөөд тэрээр эмпатик харилцааг тухайн цаг мөчид байж, нөгөө хүнээ анхаарч сонсон бусдыг дэмжих явдал юм хэмээн тодорхойлсон бөгөөд бусдад ойлгогдсон, сонсогдсон мэдрэмж төрүүлэх нь чухал гэжээ.\n\nIgnite 360-ын гүйцэтгэх захирал Роб Волфе нь эмпатик харилцаа нь харилцаж буй хүндээ ойлгогдож, сонсогдсон имэдрэмж авахад нь туслах явдал юм гэж үзжээ.\n\nТэрээр "Эмпатик харилцаа бол та харилцаж буй хүнийхээ үзэл бодлыг ойлгож, анхааралдаа авч байгаа гэдгээ мэдрүүлэх чадвартай байх явдал юм гэжээ. Масловын хэрэгцээний шатлалын үндсэн түвшинг хангах нь нөгөө хүн таны хэлэх зүйлийг илүү хүлээн авч, илүү утга учиртай байдлаар оролцох нөхцөлийг бүрдүүлдэг."\n\nМөн тэрээр 2 төрлийн эмпатиг ойлгохын чухлыг онцолсон байна. Эдгээр нь:',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .list(
        ['Танин мэдэхүйн (Cognitive)', 'Сэтгэл хөдлөлийн (Emotional)'],
        doc.x,
        doc.y,
        {
          bulletRadius: 1.5,
          align: 'justify',
          bulletIndent: 20,
        },
      )
      .moveDown(1);
    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text('Танин мэдэхүйн эмпати', doc.x, doc.y)
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Танин мэдэхүйн эмпати гэдэг нь бусдын сэтгэл хөдлөлийн байдлыг мэдэх явдал юм. Энэ нь бидэнд хүмүүстэй уулзаж, яагаад гунигтай, яагаад урам хугарах болсныг ойлгох боломжийг олгодог. Энэ нь бидэнд бусдын өнцгөөс аливаа зүйлийг харах боломжийг олгодог.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(0.5);

    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text('Сэтгэл хөдлөлийн эмпати', doc.x, doc.y)
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Сэтгэл хөдлөлийн эмпати гэдэг нь бусад хүмүүс аливаа сэтгэл хөдлөлийг хэрхэн мэдэрч, хуваалцаж байгааг ойлгох явдал юм. Энэ нь танин мэдэхүйн эмпатигаас давж, тухайн хүнтэй сэтгэл хөдлөлийн туршлагаа хуваалцах боломжийг бидэнд олгодог. Сэтгэл хөдлөлийн эмпатигийн ачаар бид бусдад өвдөж зовсон үед нь туслахад илүү бэлэн байдаг.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc.text(
      'Волпегийн хэлснээр танин мэдэхүйн эмпати болон сэтгэл хөдлөлийн эмпати нь ажлын байран дээрээ болон амьдрал дээр илүү дээр харилцаа үүсгэхэд чухал үүрэгтэй юм.',
      { align: 'justify' },
    );
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Эмпатик харилцааны тухай');
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Өөрөөр хэлбэл сэтгэл хөдлөлийн эмпати нь бусдын аливаа мэдрэмжийг тэдэнтэй хамт мэдрэхийг хэлдэг бол танин мэдрэхүйн эмпати нь бусдын харах өнцгөөс аливаа асуудлыг харах юм. Танин мэдэхүйн эмпатиг бид ажлын орчинд болон өдөр тутмын амьдралд ихээхэн ашигладаг ба сэтгэл хөдлөлийн эмпатиг бид илүү ойр дотны хүмүүстэйгээ буюу гэр бүл, найз нөхөдтэйгөө харилцах тохиолдолд ихэвчлэн ашигладаг байна. Зарим хүмүүсийн хувьд сэтгэл хөдлөлөө нээх, сэтгэл хөдлөлөө илэрхийлэх, сэтгэл хөдлөлийн төлөв байдлаа тунгааж боловсруулахад хүндрэлтэй байдаг ба энэ нь тэднийг эмпатик байхаас айлгаж холдуулдаг байна. Гэвч сэтгэл хөдлөлийн эмпатигийн танин мэдэхүйн талыг таньж мэдсэнээр ажлын эсвэл ямарваа нэгэн харилцаанд эмпатик байхад илүү хялбар болгодог байна.',
        { align: 'justify' },
      )
      .moveDown(1);
    doc
      .font(fontBold)
      .fontSize(13)
      .fillColor(colors.black)
      .text(
        'Тодорхойлолт #2: Эмпатик харилцаа нь аливаа санааг хэрхэн хүргэх тухай',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Бид эмпатик харилцааг тодорхойлохыг хичээж байгаа учир энэхүү хэсэгт хүмүүс хоорондын мэдээлэл солилцох тухайд авч үзье. Be Brown Brave LLC-ын гүйцэтгэх захирал Мишел Стар эмпатик харилцааг тодорхойлохдоо: Эмпатик харилцаа нь хүмүүс хоорондоо харилцахдаа нэгнийхээ таагүй байдал болон өвдөлт, шаналалыг аман болон бичгийн харилцаанаас мэдрэх явдал юм хэмээн тодорхойлсон байна.\n\nFactorum Consulting-ын үүсгэн байгуулагч, захирал Доминик К.Хавкинс эмпатик харилцаа нь аливаа агуулгыг хэрхэн хүргэх талаар юм хэмээжээ. Тэрээр эмпатик харилцааг аливаа санаа болон мэдээллийг бусадтай хуваалцахдаа бусдын ойлголт, харах өнцөг болон сэтгэл хөдлөлийг харгалзан хуваалцах явдал хэмээн үздэг байна. Энэ нь аливаа заавар болон мэдээллийг түгээхдээ харилцаж буй хүнийхээ оронд өөрийгөө тавьж үзэх гэсэн үг юм. Ерөнхийдөө эмпатик харилцаа нь төвөгтэй үед аливаа агуулгыг хэрхэн хүргэх талаар юм.',
        { align: 'justify' },
      )
      .moveDown(1);
    doc
      .font(fontBold)
      .fontSize(13)
      .fillColor(colors.black)
      .text(
        'Тодорхойлолт #3: Эмпатик харилцаа нь бусдыг ойлгож, нөгөө хүнийхээ нөхцөл байдалд өөрийгөө тавьж авч үзэх харилцаа юм.',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Human Leaders-ын үүсгэн байгуулагч, захирал Алексис Захнер эмпатик харилцаа бол бусдын оронд өөрийгөө тавьж үзэн өрөвдөх сэтгэлтэйгээр харилцах явдал юм гэж тодорхойлжээ.\n\nЭмпатик байх нь бусдыг ойлгож, бусдын оронд өөрийгөө тавьж үзэх явдал бөгөөд бусадтай эмпатик байдлаар харилцахын тулд дан ганц өөрийн харах өнцгөөр бус бусдын байр сууринд өөрийгөө тавьж үзэн өрөвч сэтгэлээр хандаж, тэднийг ойлгож харилцах явдал юм.',
        { align: 'justify' },
      );
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Зөвлөмж');
    doc
      .font(fontBold)
      .fontSize(13)
      .fillColor(colors.black)
      .text(
        'Та өөрийн авсан оноог өсгөх – Эмпатик байдлаа хөгжүүлэх зөвлөмж:',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Дараах арга зам, дадлуудыг өдөр тутмын амьдралдаа хэвшүүлснээр TEQ-ийн оноог өсгөх буюу таны эмпатийн чадварыг сайжруулах боломжтой:',
        { align: 'justify' },
      )
      .moveDown(1);

    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text(
        'Бусдын сэтгэл санааг анзаарч, “нийгмийн мэдрэмж”-ээ хөгжүүлэх',
        doc.x,
        doc.y,
      )
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Өдөр тутамдаа бусдын нүүрний хувирал, дохио зангаа, дууны өнгө зэрэг вербал бус дохиог анхааралтай ажиглах дадалтай болоорой. Энэ нь таны нийгмийн мэдрэмж (social sensitivity)-ийг дээшлүүлэх үндсэн арга зам юм. Хүн ярьж байх үед зөвхөн хэлж буй үгсийг нь сонсоод зогсохгүй биеийн хэлэмж, царайны илэрхийллээс нь тэр хүний мэдрэмжийг уншихыг хичээх нь эмпатийг нэмэгдүүлдэг. Жишээ нь, хамтран ажиллагч тань ядруу байдалтай бол зөвхөн “би зүгээр” гэсэн үгийг нь авч үзэлгүй, царай зүс, хоолойны өнгөнд нь анхаарал хандуул. Ингэснээр та тухайн хүний үнэн төрх сэтгэл хөдлөлийг ойлгож, хэрэгтэй үед нь туслах боломжийг олж харах болно. Нөгөөтэйгүүр, “өөрийгөө бусдын оронд тавих” буюу тухайн хүний нөхцөл байдал, мэдрэмжийг өөр дээрээ төсөөлөн бодох дасгал хийж заншаарай. Энэ нь таны танин мэдэхүйн эмпати (perspective-taking)-ийг сайжруулж, цаашлаад сэтгэл хөдлөлийн түвшинд бусдыг мэдрэхэд нэмэр болдог. Өдөр тутам тааралдах хүмүүсийн талаар “Хэрэв би энэ хүний нөхцөлд байсан бол юу мэдрэх байсан бол?” гэж дотроо нэг асуугаад үзэхэд илүүдэхгүй.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(1);
    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text('Идэвхтэй сонсох дадлыг эзэмших', doc.x, doc.y)
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Идэвхтэй сонсох нь эмпатийг хөгжүүлэх хамгийн хүчтэй хэрэгслүүдийн нэг юм. Хэн нэгний ярьж буйг анхааран төвлөрч, ярьж дуусахаас нь өмнө хариуг бэлдэхгүйгээр, үнэхээр ойлгохыг зорьж сонсоорой. Сонсож байх үедээ тохиромжтой дохих, нүдээр харилцах, шаардлагатай үед зөөлөн асуулт асуух зэргээр өөрийгөө сонсож буйгаа илэрхийлээрэй. Ингэж ухамсартайгаар сонсох үйл явц нь ярьж буй хүндээ “үнэлэгдэж, ойлгогдож байна” гэсэн мэдрэмж төрүүлдэг төдийгүй сонсож буй таны хувьд тэр хүний сэтгэл хөдлөлийг илүү сайн хуваалцах боломжийг бүрдүүлдэг canr.msu.edu. Судлаачдын үзэж байгаагаар идэвхтэй сонсох болон эмпати хосолсон үед харилцааны холбоос илүү бат бөх болж, хүмүүсийн хоорондын итгэлцэл нэмэгддэг байна canr.msu.edu. Иймээс өдөр тутам энгийн яриан дээрээс эхлэн гэр бүл, найз нөхөд, хамт олноо чин сэтгэлээсээ сонсох дадлыг хэвшүүлснээр таны эмпатийн чадвар аяндаа дээшлэх болно.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(1);
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Зөвлөмж');

    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .fontSize(12)
      .text('Өөрийн сэтгэл хөдлөлийг танин мэдэх, зохицуулах', doc.x, doc.y)
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Эмпатийн үндэс нь өөрийн мэдрэмжээ ойлгож, удирдаж сурах явдал юм. Та өөрийн сэтгэл хөдлөлийг сайн таньж мэддэг бол бусдынхаас ялган ойлгоход хялбар болно. Өдөр бүрийн туршид төрсөн мэдрэмжээ ажиглах, нэрлэх (жишээ нь, “би одоо уурлаж байна”, “би сэтгэл гонсойж эхэллээ” гэх мэт) дадлыг өөртөө суулгаарай. Мөн сэтгэл хөдлөлөө илэрхийлэх аргуудыг (бичих, дүрслэх, найздаа ярих зэргээр)  өөрийгөө илүү сайн ойлгохыг хичээх хэрэгтэй. Өөрийгөө ойлгох нь өрөөлийг ойлгох эхлэл тул энэ алхмыг хийснээр та бусдын мэдрэмжийг тольдох суурь чадамжаа дээшлүүлнэ.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(1);

    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text('Өрөвч сэтгэл, энэрэнгүй байдлыг дадлагажуулах', doc.x, doc.y)
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Бусдад туслах жижиг үйлдлүүдийг ч болов санаачилж хийх нь таны өрөөлд хандах сэтгэл, энэрэнгүй занг хөгжүүлдэг. Өдөр бүр санамсаргүй ч бай, санаатайгаар ч бай өрөөлд тусалж баярлуулах нэг үйлдэл хийхийг зорих хэрэгтэй. Жишээлбэл: Танихгүй хүнд зам зааж өгөх, автобусанд өндөр настанг суулгах, сэтгэлээр унасан найзыгаа тайвшруулах зэргээр ензим үйлдэл ч байсан таны дотор бусдын төлөө гэсэн өгөөмөр сэтгэлийг тэтгэдэг. Энэ нь аажмаар таны эмпатийн “булчинг” ажиллуулж буйтай адил бөгөөд цаг хугацааны явцад өрөвдөх, энэрэх мэдрэмж тань илүү хурдан автоматаар төрдөг болохыг анзаарах болно. Мөн өрөвч сэтгэлийг хөгжүүлэх нэг арга нь сайн дурын ажилд оролцох явдал юм – бусдад туслах үйлсэд гар бие оролцсоноор та бусдын оронд өөрийгөө тавьж, зовлон жаргалыг нь хуваалцаж сурах дадалтай болно.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(1);
    doc.image(assetPath('icons/author'), doc.x, doc.y - 2, {
      width: 16,
      height: 16,
    });
    doc.x += 21;
    doc
      .font(fontBold)
      .fillColor(colors.orange)
      .text(
        'Эмпатийг хөгжүүлэх тусгай дасгал, сургалтад хамрагдах',
        doc.x,
        doc.y,
      )
      .moveDown(0.5);

    doc.x -= 21;
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Хэрэв та илүү зорилготойгоор эмпатийг нэмэгдүүлэхийг хүсвэл сэтгэл судлал, хувь хүний хөгжлийн чиглэлээрх сургалт, дасгалуудыг ашиглаж болно. Өөрийгөө илүү өрөвч байхад сургах бясалгал хийх (жишээ нь, loving-kindness буюу нигүүлсэнгүй сэтгэлийн бясалгал хийх), эмпати дэмжих role-play буюу дүрд хувирч бусдын нөхцөл байдлыг мэдрэх дасгал хийх зэрэг аргууд үр дүнтэй. Мөн ном зохиол унших нь (ялангуяа уран зохиол, хүүрнэл зохиолууд) бусдын дотоод ертөнцөд нэвтрэх нэг арга болдог гэсэн судалгаа байдаг. Жишээлбэл: Та өгүүллэг, туужийн дүрүүдийн оронд өөрийгөө тавьж унших нь бусдын мэдрэмжийг тольдох чадварт эерэгээр нөлөөлж мэдэх юм. Түүнчлэн эмпатийн талаар онолын мэдлэгийг нэмэгдүүлэх (сэтгэл судлалын ном, нийтлэл унших, сургалтанд суух) нь өөрийн хандлага, ойлголтыг гүнзгийрүүлж, аливаа нөхцөлд илүү энэрэнгүй хандах сэдэл төрүүлэх боломжтой.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(1);
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Зөвлөмж');
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Дээрх зөвлөмжүүдийг тууштай хэрэгжүүлснээр таны TEQ оноо аажмаар нэмэгдэж, энэ нь бодит амьдрал дээр бусдыг ойлгон тэдэнд дэм тус болох чадвар дээшилж буйн илрэл болох юм. Эмпати хөгжих нь нэг өдрийн ажил биш ч өдөр бүрийн жижиг өөрчлөлт, хүчин чармайлт таныг улам өрөвч, энэрэнгүй, бусдад эерэгээр нөлөөлдөг хүн болоход хүргэнэ. \n\nБусдын сэтгэл хөдлөлийг ойлгож, илүү дулаан уур амьсгалыг бүрдүүлэхэд туслах дараах 20 хэллэгийг өдөр тутмын ажил,  харилцаандаа хэрэглээд нэг үзээрэй.',
        doc.x,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(1);
    doc
      .font(fontBold)
      .fontSize(13)
      .fillColor(colors.black)
      .text('Ажлын байран дээрээ эмпатик байдлаа илэрхийлэх 20 хэллэг', {
        align: 'justify',
      })
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.lg)
      .list(
        [
          'Чамд ямар санагдаж байгааг ойлгож байна.',
          'Энэ нөхцөл байдал чамд хэцүү/чухал/гайхалтай санагдаж байгаа байх, тийм үү?',
          'Энэ төсөл/даалгавар чамд хүндхэн санагдаж байгааг мэдэрч байна.',
          'Тийм ээ, би чиний хэлсэнтэй санал нийлж байна.',
          'Би чиний талд байна.',
          'Би яаж тусалж чадах вэ?',
          'Би чамд хэрэгтэй зүйлийг хийж өгч чадна шүү.',
          'Чамд яг одоо ямар санагдаж байна?',
          'Ийм зүйл тохиолдсонд үнэхээр харамсаж байна.',
          'Надад ийм зүйл тохиолдсон бол бас л хэцүү байх байсан.',
          'Чамайг ахиц дэвшил гаргаж байгааг харахад үнэхээр таатай байна.',
          'Сайн ажилласан байна.',
          'Надад сэтгэлээ нээж, хуваалцсанд баярлалаа.',
          'Чиний хэлэх гэсэн санаа чинь… энэ үү?',
          'Чиний өмнөөс баярлаж байна.',
          'Энэ асуудлын талаар чи юу гэж бодож байна?',
          'Чи энэ нөхцөл байдалд хэр удаж байгаа вэ?',
          'Яг ямар асуудал тулгарсан бэ?',
          'Хэрвээ тусламж хэрэгтэй бол надад хэзээд хэлээрэй.',
          'Чиний санаа зовниж байгааг/баярлаж байгааг ойлгож байна.',
        ],
        doc.x,
        doc.y,
        {
          bulletRadius: 1.5,
          listType: 'numbered',
          align: 'justify',
          bulletIndent: 20,
        },
      );
    footer(doc);
  }
}
