import { Injectable } from '@nestjs/common';
import sharp from 'sharp';
import { ExamEntity } from 'src/app/exam/entities/exam.entity';
import { ResultDetailEntity } from 'src/app/exam/entities/result.detail.entity';
import { ResultEntity } from 'src/app/exam/entities/result.entity';
import {
  assetPath,
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/app/exam/reports/formatter';
import { VisualizationService } from 'src/app/exam/visualization.service';
import { buffer } from 'stream/consumers';
@Injectable()
export class Holland {
  constructor(private vis: VisualizationService) {}
  static values = [
    'Realistic',
    'Investigative',
    'Artistic',
    'Social',
    'Enterprising',
    'Conventional',
  ];

  public result(v: string) {
    let res = {
      name: '',
      name_mn: '',
      key: '',
      description: '',
      color: '',
      fill: '',
      icon: '',
      image: '',
      skills: '',
      insight: '',
    };

    const value = v.toLowerCase();
    if (value == 'realistic') {
      res = {
        name: 'Realistic',
        name_mn: 'Гарын уртай',
        key: 'R',
        description:
          'Практик, бодит байдалд суурилсан, гар бие оролцсон, биеийн хүчний орсон ажил',
        color: colors.steel,
        fill: colors.steel,
        icon: 'implementer',
        image: 'r',
        skills:
          '• Багаж, техник технологи ажиллуулах\n• Загварчлах, зохион бүтээх, засварлах\n• Жолоодох, залах\n• Нарийн, жижиг, анхаарал шаардсан зүйлстэй ажиллах\n• Амьтан, ургамалтай харьцах',
        insight:
          'Гарын уртай хэв шинжийн хүмүүс илүү бодит практикт суурилсан, гарын ажиллагаа, ур дүй шаардсан ажил хийх сонирхолтой. Харин бичиг цаас болон хүмүүстэй ажиллах төдийлөн дуртай биш.\n\nГарын уртай төрлийн хүмүүсийн ихэвчлэн идэвхтэй, эрч хүчтэй, сэтгэлийн санааны хувьд тогтвортой зан төлөвтэй. Тэд ихэвчлэн машин техник, зүйлсийг  ажиллуулах, бүтээн босгох, угсрах, засварлах, загварчлах зэрэг гарын ажиллагаа, ур дүй шаардсан ажилд дуртай, ургамал, амьтадтай харьцах, биеийн хүч шаардсан дасгал хөдөлгөөн хийх болон гадаа орчинд ажиллах хүсэлтэй хүмүүс байдаг. Энэ төрлийн хүмүүсийн хувьд анги танхимд хичээл үзэхээс илүүтэй өөрийн бодит амьдрал дээрх туршлага дээр үндэслэн “хийж байж сурах” аргаар асуудалд ханддаг. Тэд өөрсдийгөө биеийн хүч, хөдөлмөр шалгасан ажил, спортод авьяастай, нарийн ур чадвар сайтай гэж тодорхойлдог. \n\nГарын уртай хэв шинжийн хүмүүсийн хувьд цаашид техник ур чадварыг нь дэмжин хөгжүүлэх, бодит үр дүнг бүх боломжтой ажлын орчин нөхцөл илүү тохиромжтой. Энэ төрөлд ерөнхийдөө гар урлал, спорт, цэрэг, хамгаалалтын алба, барилга, төлөвлөлт, засвар, техникийн үйлчилгээ, ургамал/амьтантай ажиллах, өсгөн үржүүлэх болон гадаа орчин нөхцөлд ажиллах боломжтой ажлууд багтана.\n\nТохирох мэргэжлийн салбар, чиглэлүүд: инженерчлэл, техникч, цахилгаан электроник, барилга байгууламж, мужаан, зам тээвэр, машин механизмын ажиллагаа, хөдөө аж ахуй, газар тариалан, мал аж ахуй, малын эмч, төрөл бүрийн спорт болон цэрэг, хамгаалалтын алба гэх мэт орно. \n\nХолбогдох хичээл, салбарууд: Хөдөлмөр, технологи, хөдөө аж ахуй, газар тариалан, цэцэрлэгжүүлэлт, математик, алгебр, геометр, бизнес, физик.',
      };
    }
    if (value == 'investigative') {
      res = {
        name: 'Investigative',
        name_mn: 'Судлаач',
        key: 'I',
        description: 'Судалгаа шинжилгээ, оюуны хөдөлмөр илүү шаардсан ажил',
        color: colors.sun,
        fill: colors.sun,
        icon: 'plant',
        image: 'i1',
        skills:
          '• Мэдээллийг адлан шинжлэх, нэгтгэн дүгнэх\n• Логик сэтгэлгээ\n• Тооцоолох, бодох\n• Шүүн тунгаах, оношлох\n• Судалж шинжлэх, туршилт явуулах',
        insight:
          'Судлаач хэв шинжийн хүмүүс нь сэтгэн бодох, оюуны хүч шаардсан ажил хийх илүү сонирхолтой. Харин эсрэгээрээ биеийн хүчний хөдөлмөр оролцсон эсвэл удирдан чиглүүлэх төрлийн ажилд ихэвчлэн дур сонирхол бага. \n\nСудлаач хэв шинжид голдуу мэдээллийг задлан шинжлэх, нэгтгэн дүгнэх чадвар өндөр, логик болон шүүмжлэлт сэтгэлгээ сайн, оюуны чадвар өндөртэй, гярхай ажиглагч зан төлөвтэй хүмүүс багтдаг. Тэд шинжлэх ухааны талаар уншиж судлах дуртай, тоо баримт дээр ажиллах, юмс үзэгдлийн учир шалтгаан, холбоо хамаарлыг судалж ойлгох, судалгаа, эрдэм шинжилгээний ажил хийж гүйцэтгэх сонирхолтой. Хийсвэр, нарийн төвөгтэй асуудлыг ухаж ойлгох, шийдвэрлэх нь зарим хүнд хэцүү санагддаг бол судлаач хэв шинжийн хувьд харин ч эсрэгээрээ хийх дуртай зүйлс нь юм. Тэд мэдлэг боловсрол, шинжлэх ухааныг эрхэмлэн үздэг бөгөөд өөрсдийгөө илүү мэдлэгтэй, судалгаа хийж гүйцэтгэх, тооцоолох, статистик чадвар сайтай гэж тодорхойлдог. \n\nСудлаач хэв шинжийн хүмүүсийн хувьд судалгаа шинжилгээний ажлын ур чадварыг нь дэмжиж, сайжруулах, шинэ санаа дэвшүүлэх, анхаарлаа төвлөрүүлэх, бие даан ажиллах боломжоор нь хангасан ажлын орчин нөхцөл илүү тохиромжтой. Энэ төрөлд ерөнхийдөө амьд бус зүйлсээс эхлээд амьд амьтан организм, өвчин эмгэг, хүний зан төрх, сэтгэл судлалыг судлах, шинжлэх ажлууд орно. \n\nХолбогдох хичээл, салбарууд: Математик/статистик, мэдээллийн технологи, эрүүл мэндийн тусламж үйлчилгээ, анагаах ухаан, биологи, амьтан болон ургамал судлал, нийгмийн шинжлэх ухаан, физик.',
      };
    }
    if (value == 'artistic') {
      res = {
        name: 'Artistic',
        name_mn: 'Уран бүтээлч',
        key: 'A',
        description: 'Урлаг, уран сайхан, бүтээлч сэтгэлгээ шаардсан ажил',
        color: colors.rust,
        fill: colors.rust,
        icon: 'shaper',
        image: 'a1',
        skills:
          '• Бүтээлч, шинийг санаачлах\n• Дүрслэх, төсөөлөх бодох\n• Урлаг, гоо зүйн мэдрэмж, өвөрмөц авьяас\n• Өөрийгөө илэрхийлэх, тайлагнах',
        insight:
          'Уран бүтээлч хэв шинжийн хүмүүс жүжиглэх, хөгжимдөх, зураг зурах,  загвар зохион бүтээх зэрэг урлагийн талын ажилд илүү дур сонирхолтой.\n\nЭнэ хэв шинжид тохирох хүмүүс уран сэтгэмж, зөн совингийн мэдрэмж өндөр, уян хатан, мэдрэмтгий зан төлөвтэй. Тэд ихэвчлэн бүтээлч, шинэлэг байдлыг эрэлхийлдэг, тогтсон хэв загварт баригдах дургүй, сонин содон, өвөрмөц зүйлс дуртай, зохиол бичих, жүжиг туурвих, дуулах, бүжиглэх зэрэг төрөл бүрийн урлаг соёлтой холбоотой ажилд дуртай. Тэд гоо зүйг илүүд эрхэмлэж үздэг бөгөөд өөрсдийгөө бүтээлч, чөлөөт сэтгэлгээтэй, хөгжим, бичих, жүжиглэх зэрэг урлагийн өвөрмөц авьяас чадвартай гэж тодорхойлдог. Ажил, бүтээлээрээ дамжуулан өөрсдийгөө бусдад, нийгэмд илэрхийлэхийг эрэлхийлдэг. \n\nУран бүтээлч хэв шинжийн хүмүүсийн хувьд төсөөлөх, шинийг санаачлах, бүтээлч чадвараа хөгжүүлэх боломжоор нь хангасан, чөлөөтэй ажлын орчин нөхцөл чухал. Энэ төрөлд ерөнхийдөө хөгжимчин, сэтгүүлч, барималчин, жүжигчин, зохиолч, загвар зохион бүтээгч, зураглаач, үсчин, график дизайнер, интерьер дизайн төлөвлөгч, төрөл бүрийн засал чимэглэлтэй холбоотой мэргэжил, хүлээн авалтын зохицуулагч зэрэг ажлууд орно.\n\nХолбогдох хичээл, салбарууд: Дүрслэх урлаг, график дизайн, хэл судлал, тайзны урлаг, хөгжим, уран зохиол, тогооч, хүнс судлал, нийгмийн шинжлэх ухаан, сэтгүүл зүй.',
      };
    }
    if (value == 'social') {
      res = {
        name: 'Social',
        name_mn: 'Нийгмийн идэвхтэй',
        key: 'S',
        description:
          'Хүмүүс, олон нийтэд чиглэсэн ажилд сонирхолтой; бусдад туслах, үйлчлэх ажил',
        color: colors.leaf,
        fill: colors.leaf,
        icon: 'teamworker',
        image: 's',
        skills:
          '• Хүмүүст заах, багшлах\n• Зөвлөгөө өгөх\n• Тусламж, үйлчилгээ үзүүлэх\n• Харилцааны ур чадвар\n• Багаар ажиллах',
        insight:
          'Нийгмийн идэвхтэй хэв шинжийн хүмүүс нь бусад хүмүүстэй ажиллаж, тэдэнд туслах дуртай. Харин эсрэгээрээ эд зүйлс, техник технологи, хийсвэр мэдээлэлтэй ажиллахаас зайлсхийх хандлагатай. \n\nНийгмийн идэвхтэй хэв шинжид ихэвчлэн хүмүүнлэг энэрэнгүй, нөхөрсөг, тусч, нийтэч, бусдын сайн сайхны төлөө ажиллах хүсэл эрмэлзэл, зан төлөвтэй хүмүүс багтдаг. Тэд хүмүүс хоорондын болон нийгмийн харилцааг илүү анхаарч сонирхдог. Энэ төрлийн хүмүүс бусадтай харилцаж ойлголцох, бусдад зааж зөвлөх, бусдад туслах, дэмжлэг үзүүлэх ажил хөдөлмөрөөс аз жаргал, сэтгэл ханамж авдаг. Ихэнхдээ багаар ажиллах боломжийг эрэлхийлж, харилцааны ур чадвараа ашиглан асуудлыг зөвшилцөж шийдвэрлэхийг эрмэлздэг. Энэ хэв шинжийн хүмүүс өөрсдийгөө голдуу бусдыг сайн ойлгодог, тусч, бусдад заах, багшлах ур чадвар сайтай гэж тодорхойлдог.\n\nНийгмийн идэвхтэй хэв шинжийн хүмүүсийн хувьд багаар ажиллах, бусадтай санал бодлоо солилцох боломжоор хангасан ажлын орчин нөхцөл илүү тохиромжтой. Энэ төрөлд ерөнхийдөө багш, зөвлөгч, боловсролын байгууллагын ажилтан, лам/шашны байгууллагын ажилтан, нийгмийн ажилтан, эрүүл мэндийн ажилтан, нийгмийн эрүүл мэнд судлаач, нийгэм судлаач, хүмүүнлэг, тусламжийн байгууллагын ажилтан, хүний нөөцийн мэргэжилтэн зэрэг ажлууд орно. \n\nХолбогдох хичээл, салбарууд: Нийгэм судлал, эрүүл мэнд, анагаах ухаан, нийгмийн эрүүл мэнд, урлаг судлал.',
      };
    }
    if (value == 'enterprising') {
      res = {
        name: 'Enterprising',
        name_mn: 'Санаачлагч',
        key: 'E',
        description:
          'Удирдах, манлайлах, бусдад нөлөөлөл үзүүлэх чиглэлийн ажил',
        color: colors.brown,
        fill: colors.brown,
        icon: 'completer',
        image: 'e',
        skills:
          '• Бусдад нөлөөлөх, удирдах, манлайлах\n• Зохион байгуулах\n• Шийдвэр гаргах\n• Эрсдэл хүлээх\n• Худалдах, борлуулах\n• Ятгах, сурталчилах',
        insight:
          'Санаачлагч хэв шинжийн хүмүүс бизнес эхлүүлэх, хөгжүүлэх, хэрэгжүүлэх, удирдах манлайлах чиглэлийн ажил үйлсэд дуртай. Аливаа зүйлийн талаар удаан хугацаагаар бодохоос илүү санаагаа шууд ажил хэрэг болгохыг илүүд үздэг.\n\nСанаачлагч хэв шинжтэй хүмүүс ерөнхийдөө эрч хүчтэй, урам зориг тэмүүлэлтэй, өөртөө итгэлтэй, адал явдалд дуртай, эрсдэл гаргах, шийдвэр гаргахаас айдаггүй, нийтэч зан төрхтэй байдаг. Тэд бусдад нөлөөлөх, өөртөө ятгаж итгүүлэх, гэрээ хэлэлцээ, борлуулалт хийх, зохион байгуулах, олны өмнө үг хэлэх, илтгэх, удирдан манлайлах зэрэг бусадтай харилцах харилцааны өндөр ур чадвартай. Энэ чадвараа ашиглан зорилгодоо хүрэх, ашиг олохдоо гаргууд сайн бөгөөд маркетинг, борлуулалт, удирдлага, улс төрийн ажилд илүү дуртай. Тэд өөрсдийгөө эрч хүч ихтэй, өөртөө итгэлтэй, бусдыг удирдах чадвартай, уран илтгэх чадвартай гэж тодорхойлдог.\n\nСанаачлагч хэв шинжийн хүмүүсийн хувьд удирдлага, менежмент, худалдаа, маркетингийн чиглэлээр үйл ажиллагаа эрхлэх, шийдвэр гаргах, үр дүнд эсвэл эрх мэдэл, санхүү, албан тушаал хувьд ахин дэвших, урамшуулал авах боломжоор хангасан ажлын орчин нөхцөл илүү тохирно. Энэ төрөлд ерөнхийдөө удирдлага, менежментийн түвшний ажлуудаас гадна бизнес, банк санхүү, үйлдвэрлэл, үйлчилгээ, маркетинг/сургалт сурталчилгаа, улс төр, хууль эрх зүйн чиглэлийн ихэнх ажил, мэргэжлүүд орно. \n\nХолбогдох хичээл, салбарууд: Нийгэм судлал, улс төр, бизнес санхүү менежмент, эдийн засаг, худалдаа үйлдвэрлэл, математик/алгебр.',
      };
    }
    if (value == 'conventional') {
      res = {
        name: 'Conventional',
        name_mn: 'Гүйцэтгэгч',
        key: 'C',
        description: 'Тогтсон, тодорхой, дэг журамтай ажил',
        color: colors.sky,
        fill: colors.sky,
        icon: 'coordinator',
        image: 'c',
        skills:
          '• Тооцоолох, нягтлан бодох\n• Хувийн зохион байгуулалт\n• Нямбай, эмх цэгцтэй\n• Тэсвэр хатуужилтай, хичээнгүй \n• Хариуцлагатай, үнэнч шударга\n• Санхүү, мөнгө хариуцах, захиран зарцуулах',
        insight:
          'Гүйцэтгэгч хэв шинжийн хүмүүс тодорхой дэг журам, стандарт, зааварчилгааг дагаж мөрдөх, биелүүлэх болон өгөгдөл, мэдээлэлтэй ажиллах сонирхолтой. \n\nИхэвчлэн нягт нямбай, хувийн зохион байгуулалт сайтай, гүйцэтгэл, бүтээмж өндөртэй, тэсвэр хатуужилтай, үнэнч шударга, хариуцлагатай зан төрхтэй хүмүүс гүйцэтгэх хэв шинжтэй байдаг. Гүйцэтгэгч төрлийн хүмүүс байгууллага бизнесийн орчин дахь мэдээллийн урсгалын хангах, өгөгдөл мэдээллийг эмхлэх, засах, бэлдэх, боловсруулах, хадгалах, хянан шалгах, баримт бичиг хөтлөх, тооцоолон бодох, байгууллагын зохион байгуулалтыг хангах, сайжруулах, үйл ажиллагааны төлөвлөгөө гаргах зэрэг оффисын ажилд илүү сонирхолтой. Ийм хэв шинжтэй хүмүүс өөрсдийгөө хариуцлагатай, зохион байгуулалттай, тоо мэдээлэлтэй ажиллах авьяас, ур чадвартай гэж харж, тодорхойлдог.\n\nГүйцэтгэгч хэв шинжийн хүмүүсийн хувьд тогтсон, тогтвортой бүтэц удирдлага, системийн хүрээнд үүрэг даалгавар тодорхой байх үед дуртай бөгөөд энэ шаардлагыг хангасан ажлын орчин нөхцөлийг илүүд үздэг. Харин эсрэгээрээ тодорхойгүй нөхцөл байдлаас зайлсхийх хандлагатай. Ийм ажлын орчин, төрөлд ихэвчлэн санхүү, нягтлан бодох бүртгэл, хүний нөөц, удирдлага, оффисын туслах ажилтан, бичиг хэргийн ажилтан, оффис менежер, номын санч, архивч, мэдээллийн технологич, программист гэх мэт ажил хамаарна. \n\nХолбогдох хичээл, салбарууд: Бизнес, менежмент, хүний нөөцийн удирдлага, санхүү эдийн засаг, нягтлан бодох бүртгэл, компьютер технологи, мэдээллийн технологи, программ хангамж, математик/алгебр.',
      };
    }

    return res;
  }

  async template(
    doc: PDFKit.PDFDocument,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    header(doc, firstname, lastname);
    title(doc, result.assessmentName);
    info(
      doc,
      exam.assessment.author,
      exam.assessment.description,
      exam.assessment.measure,
    );
    doc.font(fontBold).fontSize(13).text('Товч тайлбар').moveDown(0.5);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Хүмүүс танаас цаашид юу хийх эвсэл ямар мэргэжил сонгох тухай асуухад та үл ялиг инээмсэглээд, “-Одоогоор харж л байна, яарахгүй байгаа” гэж хариулаад өнгөрдөг үү? Яг үнэндээ та дотроо ирээдүйд хэн болох, юу хийх, ямар ажил хийхээ сайн шийдээгүй, эргэлзсээр байгаа юу?\n\nТа саяхан сургуулиа төгссөн байж магад. Таны хувьд сургуульд сурах нь тийм ч хэцүү байгаагүй, шинэ зүйл сурах, багшийн өгсөн даалгавруудыг хийх амархан байсан. Та хими, математик ч юм уу эсвэл зүгээр түүхийн хичээлд дуртай байсан байж магад. Харин одоо энэ бүхэн өөрчлөгдөж, та дахин дүн авахгүй, даалгавар хийхгүй, хичээлийн хуваарь дагахгүй. Бүх боломж, сонголтууд таны өмнө нээлттэй. Хэдийгээр эрх чөлөөтэй, асар том орон зай таны өмнө нээлттэй байх ч танд хааяа төөрсөн, эргэлзсэн, гайхсан мэдрэмж төрж байна уу? Магадгүй ямар мэргэжил сонгохоос илүү “Би хэн бэ?, Би юу хүсэж байна вэ? Би юу хийж чадах вэ?, Надад ямар ажил тохирох вэ?” гэдэг  нь илүү чухал асуултууд юм болов уу?\n\nХэрвээ та өөрөөсөө эдгээр асуултуудыг асууж байгаа бол та зөв газраа иржээ. Сэтгэл судлаачид олон арван жилийн туршид хүмүүсийн зан төрхийг судалж, хүмүүсийг дотор нь ажил мэргэжлийн сонирхлоор нь 6-н өөр хэв шинжид ангилах боломжтойг нээн илрүүлжээ. Хэрэв хүн өөрийн хэв шинжид тохирох ажил мэргэжлийг сонгосон бол хожим нь энэ мэргэжилдээ илүү дуртай, амжилт гаргах магадлал илүү өндөр байдгийг  мөн илрүүлсэн байна. Мэргэжил сонголтын тест буюу Холландын тест нь таны сонирхол, зан төрх, ажил хийх хэв маяг зэргийг үнэлж, танд тохирох ажлын орчин, төрлийг илүү тодорхой болгож өгдөг бөгөөд одоог хүртэл мэргэжил сонголт, карьер зөвлөгөөнд түгээмэл ашиглагдаж ирсэн юм.\n\nТанд ямар ажил мэргэжил тохирохыг одоо хамтдаа олж мэдэцгээе!',
        { align: 'justify' },
      )
      .moveDown(1);

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Тестийн тухай');
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Энэхүү мэргэжил сонголтын тест нь таны ажил мэргэжлийн сонирхлыг үнэлж, таны сонирхолд хамгийн сайн тохирч буй хэв шинжийг илрүүлж, тохирох ажил мэргэжлүүдийн жагсаалтыг гаргаж өгнө. Сэтгэл судлаач доктор Холланд анх мэргэжлийн сонирхол дээр нь тулгуурлан хүмүүсийг 6 үндсэн хэв шинжид хувааж болохыг нээн илрүүлж, өөрийн онол, тестээ боловсруулжээ. Өдгөө энэхүү тестийг мэргэжил сонголт, карьер хөгжүүлэлтийн чиглэлд дэлхий даяар түгээмэл ашиглаж байна.\n\nХолландын онол нь дараах 4 үндсэн зарчим дээр тогтоно. Үүнд:',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .list(
        [
          'Мэргэжлийн сонирхлын дагуу хүмүүсийг үндсэн 6 хэв шинжид ангилах боломжтой.',
          'Ажил мэргэжлийн орчныг мөн адилхан 6 төрөлд ангилах боломжтой.',
          'Хүмүүс өөрсдийн хэв шинжид тохирсон ажлын байр, орчин нөхцөлийг хайж олохыг эрэлхийлж байдаг.',
          'Хувь хүний хэв шинж болон ажил мэргэжлийн орчин хоёрын хоорондын тохироо нь хүний зан төрх, үйл хөдлөлд нөлөөллөө үзүүлж байдаг.',
        ],
        doc.x + 20,
        doc.y,
        {
          align: 'justify',
          bulletRadius: 1.5,
          columnGap: 8,
        },
      )
      .moveDown(1);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Тиймээс Холландын онол, загвар нь мэргэжлийн сонирхол, чиглэлээс гадна ажлын байр, орчин нөхцөл, албан тушаал, сэтгэл ханамж, зан төрх тэдгээрийн хоорондын уялдааг холбоог олон талаас нь цогцоор авч үзэж, тайлбарладаг. Хүний эзэмшсэн мэргэжил болон тухайн хүний сонирхлын хэв шинж хоорондоо тохирч буй үед хүн илүү их сэтгэл ханамж авч, ирээдүйд карьерын хувьд өсөн хөгжих, амжилт гаргах магадлал нь ихэсдэг байна. ',
        marginX,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(0.5);
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Холландын 6 хэв шинж');
    const w = (doc.page.width - marginX * 2) / 3;
    let currentY = doc.y;
    const gap = 20;
    const itemsPerRow = 3;

    for (let row = 0; row < 2; row++) {
      let rowMaxHeight = 0;

      for (let col = 0; col < itemsPerRow; col++) {
        const i = row * itemsPerRow + col;
        if (i < Holland.values.length) {
          const value = this.result(Holland.values[i]);
          const image = value.icon;

          let ml = marginX + col * w;
          let mt = currentY;
          let initialMt = mt;

          doc.lineWidth(4);
          doc
            .moveTo(ml, mt)
            .strokeColor(value.fill)
            .lineTo(ml + w, mt)
            .stroke();

          mt += 11;
          doc.image(assetPath(`icons/belbin/${image}`), ml + 4, mt, {
            width: 26,
          });

          ml += 36;
          doc
            .font('fontBlack')
            .fontSize(12)
            .fillColor(value.color)
            .text(Holland.values[i], ml + 4, mt + 2, {
              width: w - 50,
            })
            .text(value.name_mn, ml + 4, mt + 15, {
              width: w - 50,
            });

          mt += 15;
          doc
            .font('fontMedium')
            .fontSize(11)
            .fillColor(colors.black)
            .text('Зан төлөв:', ml + 4, mt + 23);

          mt += 35;
          doc.font(fontNormal).text(value.description, ml + 4, mt + 2, {
            width: w - 40,
          });

          const characterHeight = doc.heightOfString(value.description, {
            width: w - 40,
          });

          mt += 10 + characterHeight;

          const itemHeight = mt - initialMt;
          rowMaxHeight = Math.max(rowMaxHeight, itemHeight);
        }
      }

      currentY += rowMaxHeight + gap;
    }

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Холландын тестийн үр дүнг тайлбарлахдаа 6 хэв шинж тус бүрийн англи нэрийн эхний үсгийг сонгон авч кодолж хэрэглэдэг. Үүнийг мөн Холландын код, RIASEC загвар (эхний үсгүүдийн нийлбэр) гэж бас нэрлэдэг. Дээрх 6 хэв шинж нь хүмүүст харилцан адилгүйгээр хэмжээгээр илэрдэг. Гэхдээ Холландын тест нь хамгийн сайн тохирох эхний гурван хэв шинжийн хослолыг ихэвчлэн сонгон авч ашигладаг. Жишээлбэл: тестийн үр дүнд таны хэв шинж SEA гэсэн Холландын кодоор илэрхийлэгдсэн бол танд хамгийн сайн тохирох хэв шинж нь “Нийгмийн идэвхтэй (Social)” хэв шинж, түүний дараагаар нь “Санаачлагч (Enterprising)”, тэгээд “Уран бүтээлч (Artistic)” хэв шинжүүд байна гэдгийг илэрхийлж буй хэрэг юм.\n\nАжил мэргэжлийн орчин ч мөн адил голдуу эдгээр 6 хэв шинж хосолсон хэлбэрийг агуулсан байх нь элбэг. Жишээлбэл: дунд сургуулийн математикийн багшийн мэргэжлийг авч үзвэл сурагчдад тусалдаг, хүмүүстэй ажилдаг талаас энэ мэргэжлийг “Нийгмийн идэвхтэй (Social)” хэв шинж, харин асуудлыг шийдвэрлэх, мэдээлэлтэй ажилладаг талаасаа “Судлаач (Investigative)” хэв шинжтэй мөн давхар холбож авч үзнэ.',
        marginX,
        doc.y + 50,
        { align: 'justify' },
      );
    doc.lineWidth(1);

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Тестийн хэрэглээ, анхаарах зүйлс');
    doc
      .font(fontBold)
      .fillColor(colors.black)
      .fontSize(13)
      .text('Хөгжүүлэлт')
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Холландын мэргэжил сонголтын хэв шинжийг илрүүлэх олон төрлийн тестийн хувилбаруудыг судлаач нар хөгжүүлсэн байдаг.  Бидний одоо ашиглаж буй тест нь доктор Холландын RIASEC загвар дээр суурилж, Америкийн Нэгдсэн Улсын Хөдөлмөрийн Яамнаас боловсруулсан гаргасан 60 асуулт бүхий олон улсад хамгийн түгээмэл хэрэглэгддэг, сайтар судлагдсан тестийн хувилбар юм.',
        { align: 'justify' },
      )
      .moveDown(1);
    doc
      .font(fontBold)
      .fillColor(colors.black)
      .fontSize(13)
      .text('Анхаарах зүйлс')
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Эдгээр 6-н хэв шинжийн аль нэг нь сайн, эсвэл аль нэг нь муу гэсэн ойлголт огт байхгүй. Энэхүү тестийн гол зорилго нь таны мэргэжлийн сонирхлыг тодорхойлж, өөрийгөө илүү сайн, зөвөөр ойлгоход туслах юм. Энэхүү тайлантай танилцахдаа дараах зүйлсийг анхаарах хэрэгтэй.',
        { align: 'justify' },
      )
      .moveDown(1);
    doc
      .font(fontNormal)
      .fontSize(12)
      .list(
        [
          'Тайлантай танилцахдаа хэдийгээр бид хүмүүсийг энэхүү 6 хэв шинжийн аль нэгэнд ангилах боломжтой ч тодорхой хэв шинжид дурдсан зан төлөвүүд нэг хүнд заавал бүгд илрэх ёстой гэж ойлгож болохгүйг анхаарах хэрэгтэй.',
          'Зөвхөн тайланд үндэслэн өөртөө төгс тохирох ажил олно гэж найдаж, хүлээхгүй байх. Тестийн үр дүн нь таны сонирхолд нийцэх ажил мэргэжлийн ерөнхий чиглэл, зарим түгээмэл ажил мэргэжлүүдийг санал болгоно.',
          'Мэргэжил сонголтын тест нь зөвхөн таны мэргэжлийн сонирхол, чиглэлийг тодорхойлох бөгөөд харин таны мэргэжлийн ур чадвар, чадамжийг үнэлэхгүй! Тиймээс бид таныг цаашид ур чадвар, чадамжийн тестийг бөглөхийг зөвлөж байна.',
          'Та өөрийн ирээдүйн мэргэжил, ажлын карьерыг сонгохдоо аль болох олон мэдээ баримт цуглуулж, нухацтай хандах хэрэгтэй. Жишээлбэл, та Холландын тестээс гадна өөр бусад тест сорилуудыг бөглөх эсвэл сонирхож буй чиглэлээр тань ажиллаж буй хүмүүстэй холбогдож зөвлөгөө авах, тухайн ажил дээр богино хугацаагаар дадлага хийж, туршиж үзэх зэрэг аргуудыг ашиглаж болох юм.',
          'Гэр бүл, дотнын хүмүүстэйгээ тестийн үр дүн, цуглуулсан мэдээллээ хуваалцаж, зөвлөгөө аваарай.',
        ],
        doc.x + 20,
        doc.y,
        {
          align: 'justify',
          bulletRadius: 1.5,
          columnGap: 8,
        },
      )
      .moveDown(1);
    doc
      .font(fontBold)
      .fillColor(colors.black)
      .fontSize(13)
      .text('Тестийн оноог зөв тайлбарлах', marginX, doc.y)
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Мэргэжлийн сонголтын тестийн үр дүнг тооцохдоо хэв шинж тус бүрд харгалзах асуултуудын оноонуудыг хооронд нь нэгтгэж, нийлбэр оноог ашигласан. Энэхүү тестийн гол зорилго нь та өөрийн мэргэжлийн сонирхлыг олж, тодорхойлох тул тестийн үр дүн, оноогоо бусад хүмүүсийн тест бөглөсөн үр дүн, оноотой харьцуулахгүй байх хэрэгтэй.',
        { align: 'justify' },
      )
      .moveDown(1);

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Сорилын үр дүн');
    const code = result.result;
    const letters = code.split('');

    const namesMn = letters
      .map((l) => {
        return Holland.values
          .map((v) => this.result(v))
          .find((r) => r.key === l)?.name_mn;
      })
      .filter(Boolean)
      .join(', ');

    const value = this.result(result.value);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text('Таны үндсэн мэргэжлийн сонирхол бол ');

    doc
      .font('fontBlack')
      .fontSize(16)
      .fillColor(colors.orange)
      .text(`${value.name_mn} (${value.name})`)
      .moveDown(0.5);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text('Таны мэргэжлийн сонирхолд тохирох код бол');

    const baseX = doc.x;
    const baseY = doc.y;

    const codeWidth = doc
      .font('fontBlack')
      .fontSize(18)
      .fillColor(colors.orange)
      .widthOfString(code.toString());

    const buyuuWidth = doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .widthOfString(' буюу ');

    doc
      .font('fontBlack')
      .fontSize(18)
      .fillColor(colors.orange)
      .text(code.toString(), baseX, baseY);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(' буюу ', baseX + codeWidth + 1, baseY + 4.5);

    doc
      .font('fontBlack')
      .fontSize(14)
      .fillColor(colors.orange)
      .text(namesMn, baseX + codeWidth + 1 + buyuuWidth, baseY + 3.5)
      .moveDown(1);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Сонирхлын хэв шинж тус бүрд харгалзах оноог тооцоолж графикт үзүүлэв. Хамгийн өндөр оноо бүхий хэв шинж нь танд давамгайлан илэрч буй үндсэн хэв шинж бол харин дараа дараагийн хамгийн өндөр оноо бүхий хэв шинж нь дараачийн тод илэрч буй хэв шинжүүд юм.',
        marginX,
        doc.y,
        { align: 'justify' },
      );
    const details: ResultDetailEntity[] = result.details;
    const indicator = [];
    const data = [];
    const results = [];
    const max = details.reduce(
      (max, obj) => (parseInt(obj.value) > parseInt(max.value) ? obj : max),
      details[0],
    );

    for (const detail of details) {
      const result = this.result(detail.value);
      indicator.push({
        name: result.name,
        max: +max.cause,
        key: result.key, // <-- add this line
      });
      data.push(+detail.cause);
      results.push({ ...result, point: +detail.cause, value: detail.value });
    }

    let y = doc.y;
    const pie = await this.vis.createRadar(indicator, data);
    let png = await sharp(pie)
      .flatten({ background: '#ffffff' }) // ил тод байдал → цагаан дэвсгэр
      .png({ progressive: false }) // interlaceгүй, pdfkit-д найдвартай
      .toBuffer();
    doc.image(png, 75, y - 3, {
      width: doc.page.width - 150,
    });

    doc.y += (doc.page.width / 425) * 310 - 150;
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'RIASEC загварыг 6 өнцөгт бөгөөд өнцөг бүрд нэг хэв шинжийг оноож, харгалзуулсан гэж төсөөлье. Тэгвэл Холландын онолын дагуу хэв шинжүүд нь заавал R-I-A-S-E-C гэсэн дэс дарааллаар байрших ёстой. Энэхүү загварт зэргэлдээ орших хоёр хэв шинжүүд нь хоорондоо илүү төстэйг илэрхийлж буй бол, харин эсрэг талд орших хэв шинжүүд нь бие биеэсээ эрс ялгаатай, өөр буйг заана. Жишээлбэл, зэрэгцээ орших “Судлаач (Investigative)” болон “Уран бүтээлч (Artistic)”  хэв шинжүүд нь хоорондоо илүү төстэй, хамтдаа илрэх магадлал илүү байхад, харин загвар дээр эсрэг орших “Судлаач (Investigative)” болон “Нийгмийн идэвхтэй (Social)” хэв шинжүүд нь хоорондоо төдийлөн адилгүй, ялгаатай болохыг илтгэнэ (Трэйси & Раундз, 1993).',
        marginX,
        doc.y + 36,
        { align: 'justify' },
      );
    footer(doc);

    doc.addPage();
    header(doc, firstname, lastname, 'Танд илэрч буй хэв шинжүүд');

    letters.forEach((l, index) => {
      if (index > 0) {
        doc.addPage();
      }

      header(doc, firstname, lastname, 'Танд илэрч буй хэв шинжүүд');

      const v = this.result(
        Holland.values.find((val) => this.result(val).key === l)!,
      );

      const score =
        details.find((d) => this.result(d.value).key === l)?.cause ?? 0;
      doc
        .font('fontBlack')
        .fontSize(16)
        .fillColor(colors.orange)
        .text(`${v.name_mn} (${v.key})`, { align: 'left' })
        .moveDown(0.5);

      const startX = marginX;
      const startY = doc.y;
      const tableWidth = doc.page.width - marginX * 2;

      const leftW = tableWidth * 0.3;
      const rightW = tableWidth * 0.7;

      const row1H = 27;
      const row2H = 140;
      const totalH = row1H + row2H;

      doc.lineWidth(1).strokeColor('#000');

      doc
        .moveTo(startX, startY)
        .lineTo(startX + tableWidth, startY)
        .stroke();
      doc
        .moveTo(startX, startY + row1H)
        .lineTo(startX + tableWidth, startY + row1H)
        .stroke();
      doc
        .moveTo(startX, startY + totalH)
        .lineTo(startX + tableWidth, startY + totalH)
        .stroke();

      doc
        .moveTo(startX, startY)
        .lineTo(startX, startY + totalH)
        .stroke();
      doc
        .moveTo(startX + leftW, startY)
        .lineTo(startX + leftW, startY + totalH)
        .stroke();
      doc
        .moveTo(startX + tableWidth, startY)
        .lineTo(startX + tableWidth, startY + totalH)
        .stroke();

      doc
        .font(fontBold)
        .fontSize(12)
        .fillColor(colors.black)
        .text('Таны оноо:', startX + 8, startY + 8);
      doc
        .font('fontBlack')
        .fontSize(13)
        .text(score.toString(), startX + 75, startY + 7.75);

      doc
        .font(fontBold)
        .fontSize(12)
        .text('Таны ур чадвар', startX + leftW + 10, startY + 8);

      const imgPath = assetPath(`icons/holland/${v.image}`);
      const imgSize = Math.min(leftW, row2H);
      doc.image(imgPath, startX, startY + row1H, {
        width: imgSize,
        height: imgSize,
      });

      doc
        .font(fontNormal)
        .fontSize(12)
        .text(v.skills, startX + leftW + 10, startY + row1H + 10, {
          width: rightW - 20,
        });

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(v.insight, marginX, startY + totalH + 20, {
          align: 'justify',
          width: tableWidth,
        });

      footer(doc);
    });
  }
}
